# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]  # YOLOv8n summary: 225 layers,  3157200 parameters,  3157184 gradients,   8.9 GFLOPs
  s: [0.33, 0.50, 1024]  # YOLOv8s summary: 225 layers, 11166560 parameters, 11166544 gradients,  28.8 GFLOPs
  m: [0.67, 0.75, 768]   # YOLOv8m summary: 295 layers, 25902640 parameters, 25902624 gradients,  79.3 GFLOPs
  l: [1.00, 1.00, 512]   # YOLOv8l summary: 365 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPs
  x: [1.00, 1.25, 512]   # YOLOv8x summary: 365 layers, 68229648 parameters, 68229632 gradients, 258.5 GFLOPs

# 0-P1/2
# 1-P2/4
# 2-P3/8
# 3-P4/16
# 4-P5/32

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, efficientformerv2_s0, []]  # 4
  - [-1, 1, SPPF, [1024, 5]]  # 5

# YOLOv8-P2 head
head:
  # [from, repeats, module, args]
  # Top-down FPN path
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 6, upsample from P5 (SPPF output)
  - [[-1, 3], 1, Concat, [1]]   # 7, cat backbone P4 (from layer 3)
  - [-1, 3, C2f, [512]]         # 8 (P4_fused)

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 9, upsample from P4
  - [[-1, 2], 1, Concat, [1]]   # 10, cat backbone P3 (from layer 2)
  - [-1, 3, C2f, [256]]         # 11 (P3_fused)

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 12, upsample from P3
  - [[-1, 1], 1, Concat, [1]]   # 13, cat backbone P2 (from layer 1)
  - [-1, 3, C2f, [128]]         # 14 (P2_output) - This is the first detection head input

  # Bottom-up PAN path
  - [-1, 1, Conv, [128, 3, 2]]  # 15, downsample from P2
  - [[-1, 11], 1, Concat, [1]]  # 16, cat P3_fused (from layer 11)
  - [-1, 3, C2f, [256]]         # 17 (P3_output) - This is the second detection head input

  - [-1, 1, Conv, [256, 3, 2]]  # 18, downsample from P3
  - [[-1, 8], 1, Concat, [1]]   # 19, cat P4_fused (from layer 8)
  - [-1, 3, C2f, [512]]         # 20 (P4_output) - This is the third detection head input

  - [-1, 1, Conv, [512, 3, 2]]  # 21, downsample from P4
  - [[-1, 5], 1, Concat, [1]]   # 22, cat P5 from SPPF (from layer 5)
  - [-1, 3, C2f, [1024]]        # 23 (P5_output) - This is the fourth detection head input

  # Detection Head
  - [[14, 17, 20, 23], 1, Detect, [nc]]  # Detect(P2, P3, P4, P5)
